app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at") VALUES ('2013-10-23 01:52:18.605659', '2013-10-23 01:52:18.605659')